from flask_admin.contrib.sqla import ModelView


class TeacherView(ModelView):
    form_args = {
        'last_name': {
            'label': 'Фамилия',
        },
        'first_name': {
            'label': 'Имя',
        },
        'second_name': {
            'label': 'Отчество',
        },
        'degree': {
            'label': 'Учёная степень',
        },
        'title': {
            'label': 'Учёное звание',
        },
    }
    form_choices = {
        'degree': [
            ('—', 'Без учёной степени'),
            ('к.арх.', 'Кандидат архитектуры'),
            ('к.б.н.', 'Кандидат биологических наук'),
            ('к.вет.н.', 'Кандидат ветеринарных наук'),
            ('к.воен.н.', 'Кандидат военных наук'),
            ('к.г.н.', 'Кандидат географических наук'),
            ('к.г.-м.н.', 'Кандидат геолого-минералогических наук'),
            ('к.иск.', 'Кандидат искусствоведения'),
            ('к.и.н.', 'Кандидат исторических наук'),
            ('к.культ.', 'Кандидат культурологии'),
            ('к.м.н.', 'Кандидат медицинских наук'),
            ('к.пед.н.', 'Кандидат педагогических наук'),
            ('к.полит.н.', 'Кандидат политических наук'),
            ('к.п.н.', 'Кандидат психологических наук'),
            ('к.с.-х.н.', 'Кандидат сельскохозяйственных наук'),
            ('к.социол.н.', 'Кандидат социологических наук'),
            ('к.теол.н.', 'Кандидат теологических наук'),
            ('к.т.н.', 'Кандидат технических наук'),
            ('к.фарм.н.', 'Кандидат фармацевтических наук'),
            ('к.ф.-м.н.', 'Кандидат физико-математических наук'),
            ('к.ф.н.', 'Кандидат филологических наук'),
            ('к.филос.н.', 'Кандидат философских наук'),
            ('к.х.н.', 'Кандидат химических наук'),
            ('к.э.н.', 'Кандидат экономических наук'),
            ('к.ю.н.', 'Кандидат юридических наук'),
            ('д.арх.', 'Доктор архитектуры'),
            ('д.б.н.', 'Доктор биологических наук'),
            ('д.вет.н.', 'Доктор ветеринарных наук'),
            ('д.воен.н.', 'Доктор военных наук'),
            ('д.г.н.', 'Доктор географических наук'),
            ('д.г.-м.н.', 'Доктор геолого-минералогических наук'),
            ('д.иск.', 'Доктор искусствоведения'),
            ('д.и.н.', 'Доктор исторических наук'),
            ('д.культ.', 'Доктор культурологии'),
            ('д.м.н.', 'Доктор медицинских наук'),
            ('д.пед.н.', 'Доктор педагогических наук'),
            ('д.полит.н.', 'Доктор политических наук'),
            ('д.п.н.', 'Доктор психологических наук'),
            ('д.с.-х.н.', 'Доктор сельскохозяйственных наук'),
            ('д.социол.н.', 'Доктор социологических наук'),
            ('д.теол.н.', 'Доктор теологических наук'),
            ('д.т.н.', 'Доктор технических наук'),
            ('д.фарм.н.', 'Доктор фармацевтических наук'),
            ('д.ф.-м.н.', 'Доктор физико-математических наук'),
            ('д.ф.н.', 'Доктор филологических наук'),
            ('д.филос.н.', 'Доктор философских наук'),
            ('д.х.н.', 'Доктор химических наук'),
            ('д.э.н.', 'Доктор экономических наук'),
            ('д.ю.н.', 'Доктор юридических наук'),
        ],
        'title': [
            ('—', 'Без учёного звания'),
            ('доц.', 'Доцент'),
            ('проф.', 'Профессор'),
        ],
    }


class AssignmentView(ModelView):
    form_args = {
        'teacher_id': {
            'label': 'Преподаватель',
        },
        'position': {
            'label': 'Должность',
        },
        'date': {
            'label': 'Дата назначения',
        },
        'wage_rate': {
            'label': 'Ставка',
        },
    }
    form_choices = {
        'position': [
            (0, 'Не работает'),
            (1, 'Ассистент'),
            (2, 'Старший преподаватель'),
            (3, 'Доцент'),
            (4, 'Профессор'),
            (5, 'Заведующий кафедрой'),
        ],
    }
